Revit 2027 API
BuiltInFailures.MassFailures.CannotIntegrate Property
 In order to restore an element's 'Constrain to Massing' property to 'Dependent', it must be in the main model with the massing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotIntegrate { get; }
Public Shared ReadOnly Property CannotIntegrate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotIntegrate {
	FailureDefinitionId^ get ();
}
static member CannotIntegrate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace